app/controllers/api/v1/registrations_controller.rb

      def create
        user = User.new(sign_up_params)
        if user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_authentication_token", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?, ?)